{"sections":{"main":{"type":"about-banner-banner","settings":{"background_image":"shopify:\/\/shop_images\/Rectangle_34625113.png","heading":"Healthier Aging For All","content":"Our mission is to make advancements in aging research accessible, ensuring the benefits of optimizing one's biology are within reach for everyone."}},"our_story":{"type":"our-story-about","settings":{"image":"shopify:\/\/shop_images\/Rectangle_34625114.png","heading":"Our Story","description":"We're passionate about inclusive wellness and believe advanced supplements should be accessible to all. Alongside master Biohacker NootBro, we formulated potent, efficacious longevity supplements backed by science. Paired with a holistic and balanced lifestyle, we are confident our products will bring transformative results.","description2":"Our ultimate goal is to broaden our reach with impactful solutions worldwide—especially in places with shorter lifespans. Join us as we work towards creating a world where healthy aging isn't just an aspiration—but a reality we actively build together."}},"our_value":{"type":"our-value-about","blocks":{"list_kdK6g6":{"type":"list","settings":{"title":"Accessibility","detail":"Ensuring our longevity supplements are affordable and within reach for all, promoting inclusivity and equal access to enhanced well-being."}},"list_D6Qqig":{"type":"list","settings":{"title":"Transparency","detail":"Fostering openness about our supplement ingredients, manufacturing processes, and the science behind our products to empower customers with knowledge and build trust."}},"list_fgyRdi":{"type":"list","settings":{"title":"Sustainability","detail":"Commitment to environmentally friendly practices, sourcing responsibly, and minimizing our ecological footprint to contribute to a healthier planet for current and future generations."}}},"block_order":["list_kdK6g6","list_D6Qqig","list_fgyRdi"],"settings":{"image":"shopify:\/\/shop_images\/Rectangle_34625114_1.png","heading":"Our Values"}},"about_content":{"type":"about-page-coloumn","blocks":{"repeater_blocks_cPEdkR":{"type":"repeater_blocks","settings":{"image":"shopify:\/\/shop_images\/Rectangle_34625114_4.png","heading":"Pro-Planet. Pro-Health.","descrption":"We believe in conscious consumption, which extends to our ingredients, manufacturing, and packaging. Our cruelty-free formulas are crafted without toxic preservatives, additives, flavorings, and sweeteners, and we use organic, vegan, and gluten-free ingredients where possible. Our glass packaging is 100% recyclable. As our company grows, we're raising our sustainability standards even higher—stay tuned."}},"repeater_blocks_LUEhhj":{"type":"repeater_blocks","settings":{"image":"shopify:\/\/shop_images\/Rectangle_34625114_3.png","heading":"Accessible Pricing","descrption":"We’re committed to providing cutting-edge formulas at affordable prices. Our proprietary longevity blends not only streamline your supplement routine—they also bring significant cost savings. Rather than investing in individual ingredients, we simplify the process, ensuring you access quality nutrition without straining your budget. Because prioritizing health should be within reach for everyone."}}},"block_order":["repeater_blocks_cPEdkR","repeater_blocks_LUEhhj"],"settings":{}}},"order":["main","our_story","our_value","about_content"]}